{
  "welcome": "ការសវាកមន៍",
  "hello": "ជំរាបសួរ {{ឈ្មោះ}}!",
  "Dr Des 1": "ការអភិវឌ្ឍនិងការថែរក្សាកម្មវិធីគេហទំព័រដោយប្រើវណ្ណយុត្តិ 3 \n ល្លារប្រតិកម្មនិងបច្ចេកវិទ្យាដែលពាក់ព័ន្ធផ្សេងទៀត។",
  "Dr Des 2": "ការសហការជាមួយក្រុមដែលមានមុខងាររួមមានរួមមាន \n អ្នករចនាអ្នកគ្រប់គ្រងផលិតផលនិងអ្នកអភិវឌ្ឍន៍ផ្សេងទៀតដើម្បីបង្កើតផលិតផលដែលមានគុណភាពខ្ពស់។",
  "Dr Des 3": "អនុវត្តដំណោះស្រាយគ្រប់គ្រងរដ្ឋដោយប្រើ Pinia សម្រាប់ \n គ្រប់គ្រងរដ្ឋពិភពលោកនៅពេលសាងសង់ពាក្យសុំស្មុគស្មាញ។",
  "Dr Des 4": "អនុវត្តការរចនាឆ្លើយតបនិងធានាបាននូវភាពឆបគ្នានៃកម្មវិធីអ៊ីនធឺណិត។",
  "Dr Des 5": "ផ្តល់ការគាំទ្រដែលកំពុងបន្តការកែកំហុសនិងការកែលម្អលក្ខណៈពិសេស \n សម្រាប់កម្មវិធី។",
  "GamBit Des 1": "ការអភិវឌ្ឍនិងថែទាំកម្មវិធីគេហទំព័រនិងផ្នែកខាងក្រោយ \n ដោយប្រើខាប់ 2, បវើរ 3, អណ្តាតភ្លើង, ចុចនិងបច្ចេកវិទ្យាដែលទាក់ទងផ្សេងទៀតផ្សេងទៀត។",
  "GamBit Des 2": "អនុវត្តការគ្រប់គ្រងរដ្ឋដោយប្រើ Vuex ឬ Pinia សម្រាប់ការដោះស្រាយរដ្ឋដែលស្មុគស្មាញក្នុងកម្មវិធី VUUS ។",
  "GamBit Des 3": "ប្រើ Axios ឬបណ្ណាល័យ HTTP ផ្សេងទៀតសម្រាប់ធ្វើឱ្យសំណើ API ។",
  "GamBit Des 4": "អនុវត្តដំណោះស្រាយគ្រប់គ្រងស្ថានភាពក្នុងការរអិលដូចជា \n អ្នកផ្តល់សេវា Getx ឬប្លុក។",
  "GamBit Des 5": "សរសេរតក្កវិជ្ជារបស់ម៉ាស៊ីនមេផ្នែកខាងក្រោយដោយប្រើកម្មវិធី GO GO សរសេរកម្មវិធី \n ភាសា។",
  "Vtech Des 5": "សហការជាមួយអ្នកអភិវឌ្ឍន៍កម្មវិធីខាងក្រោយដើម្បីធានាបាននូវការប្រាស្រ័យទាក់ទងនិងការសម្របសម្រួលដោយរលូនរវាងការដាក់ពាក្យផ្សេង \n ស្រទាប់របស់កម្មវិធី។",
  "Vtech Des 4": "ការចូលរួមក្នុងការត្រួតពិនិត្យលេខកូដនិងការផ្តល់មតិយោបល់ក្នុងន័យធៀបដល់អ្នកអភិវឌ្ឍន៍ផ្សេងទៀត។",
  "Vtech Des 3": "ដំណោះស្រាយការគ្រប់គ្រងរបស់រដ្ឋដូចជា redux, recoil ឬ \n ប្រតិកម្មបរិបទសម្រាប់គ្រប់គ្រងស្ថានភាពកម្មវិធី។",
  "Vtech Des 2": "សរសេរម៉ូឌុលដែលអាចប្រើឡើងវិញបាននិងមានប្រសិទ្ធិភាពសម្រាប់ \n បង្កើតចំណុចប្រទាក់អ្នកប្រើ។",
  "Vtech Des 1": "សហការជាមួយអ្នកគ្រប់គ្រងគម្រោងនិងអតិថិជនដើម្បីស្វែងយល់ពីតម្រូវការសម្រាប់កម្មវិធីគេហទំព័រ។",
  "Bikay Des 1": "សហការជាមួយប្រធានគម្រោងដើម្បីប្រមូលផ្តុំនិងស្វែងយល់ \n តម្រូវការសម្រាប់កម្មវិធីទូរស័ព្ទចល័ត។",
  "Bikay Des 2": "សរសេរលេខកូដពាក្យសុំទូរស័ព្ទចល័តដោយប្រើដើមកំណើតប្រតិកម្មដែលអនុញ្ញាត \n សម្រាប់ការអភិវឌ្ឍកម្មវិធីឆ្លងវេទិកា។",
  "Bikay Des 3": "អនុវត្តដំណោះស្រាយគ្រប់គ្រងរដ្ឋដូចជា Redux ឬប្រតិកម្ម \n បរិបទដើម្បីគ្រប់គ្រងស្ថានភាពនៃកម្មវិធី។",
  "Bikay Des 4": "អភិវឌ្ឍតក្កវិជ្ជា Backend និង APIS ដោយប្រើក្របខ័ណ្ឌ Larave \n និងអនុវត្ត APIs ដែលនៅសល់ដើម្បីទំនាក់ទំនងជាមួយ \n ផ្នែកខាងមុខមានប្រតិកម្ម។",
  "Bikay Des 5": "ការរចនានិងអនុវត្តគ្រោងការណ៍មូលដ្ឋានទិន្នន័យដោយប្រើរោមចិញ្ចឹមរបស់ Larave Orment Orm ហើយអនុវត្តការធ្វើចំណាកស្រុកនិងការបណ្តុះមូលដ្ឋានទិន្នន័យ។",
  "Iota Des 5": "អនុវត្តតាមការអនុវត្តល្អបំផុតក្នុងការអភិវឌ្ឍន៍សូហ្វវែររួមទាំងការរៀបចំកម្មវិធីធ្វើកូដកម្មគំរូរចនានិងស្តង់ដារសរសេរកូដ។",
  "Iota Des 4": "រួមបញ្ចូលជាមួយមូលដ្ឋានទិន្នន័យដោយប្រើការភ្ជាប់ប្រព័ន្ធទិន្នន័យចាវ៉ា \n (JDBC) ឬបណ្ណាល័យចូលដំណើរការមូលដ្ឋានទិន្នន័យផ្សេងទៀត។",
  "Iota Des 3": "រចនានិងអនុវត្តអន្តរកម្មអន្តរកម្មនិងឆ្លើយតបនិងឆ្លើយតបដោយប្រើបណ្ណាល័យសមាសធាតុ Vaadin UI ។",
  "Iota Des 2": "សហការជាមួយប្រធានគ្រប់គ្រងនិងយល់ពី \n តម្រូវការសម្រាប់កម្មវិធីគេហទំព័រ។",
  "Iota Des 1": "សរសេរកូដចាវ៉ាផ្នែកខាងម៉ាស៊ីនមេដើម្បីដោះស្រាយតក្ករបស់អាជីវកម្មនិង \n ដំណើរការទិន្នន័យ។",

  "Freelance Des 1": "រចនានិងសាងសង់គ្រឿងបន្លាស់ UI ដោយប្រើសមាសធាតុ API 3 API 3 ហើយ \n អភិវឌ្ឍទម្រង់ថាមវន្តតារាងគំរូនិងផ្ទាំងព័ត៌មានដែលប្រើសមាសធាតុរបស់ Vuetify ដោយប្រើសមាសធាតុរបស់ Vuetify ។",
  "Freelance Des 2": "បញ្ចូល API ដែលនៅសល់ដើម្បីទៅយកនិងបង្ហាញទិន្នន័យហើយ \n ប្រើរ៉ោតទ័រនិងភូនីសម្រាប់ការនាំផ្លូវនាំផ្លូវនិងការគ្រប់គ្រងរដ្ឋ",
  "Freelance Des 3": "សហការជាមួយអ្នកពាក់ព័ន្ធឱ្យយល់និងប្រមូលតំរូវការសម្រាប់កម្មវិធីទូរស័ព្ទកម្មវិធីខាងក្រោយនិង API ។",
  "Freelance Des 8": "សរសេរកូដកម្មវិធីទូរស័ព្ទចល័តឆ្លងវេទិកាដែលមានប្រតិកម្មមានដើមកំណើតសម្រាប់ប្រព័ន្ធប្រតិបត្តិការ iOS និងប្រព័ន្ធប្រតិបត្តិការ Android វេទិកា។",
  "Freelance Des 4": "បង្កើតស្គ្រីបរើសស្គ្រីបដោយប្រើបណ្ណាល័យតាមសំណូមពរដ៏ស្រស់ស្អាតសេលេញ៉ូម។",
  "Freelance Des 5": "កោសមាតិកាដែលមានរចនាសម្ព័ន្ធនិងថាមវន្ត",
  "Freelance Des 6": "ការដកស្រង់ទិន្នន័យនិងសម្អាតទិន្នន័យទៅជាទ្រង់ទ្រាយដូចជា JSON, CSV, Excel, ឬរចនាសម្ព័ន្ធមូលដ្ឋានទិន្នន័យត្រៀមខ្លួនជាស្រេច។",
  "Freelance Des 7": "រៀបចំទិន្នន័យដែលនៅសល់សម្រាប់ផ្ញើអ៊ីមែល។",

  "My Self Des": "ខ្ញុំជាអ្នកអភិវឌ្ឍន៍ផ្នែកមុខគេ ដែលមានជំនាញពេញ(Full-Stack) និងមានក្ដីស្រឡាញ់ក្នុងការអភិវឌ្ឍផ្ទាំងចំណុចប្រទាក់អ្នកប្រើប្រាស់ឲ្យមានភាពរលូន និងគួរឲ្យទាក់ទាញ។ ការងាររបស់ខ្ញុំផ្តោតលើការបង្កើតកម្មវិធីឲ្យមានភាពឆបគ្នានឹងទំហំអេក្រង់ផ្សេងៗ និងងាយស្រួលប្រើសម្រាប់អ្នកប្រើ។ នៅពេលនេះ ខ្ញុំកំពុងចូលរួមចំណែកក្នុងការបង្កើតបទពិសោធន៍ឌីជីថលដែលមានគុណភាពខ្ពស់នៅក្រុមហ៊ុន DR Tech Co.,Ltd។",
  "Pheng Souphal": "ផេង សូផល",
  "Frontend Developer": "អ្នកអភិវឌ្ឍន៍ Frontend",
  "Download CV": "ទាញយកប្រវត្តិរូបសង្ខេប",
  "5 Year of experience": "បទពិសោធន៍ ៥ ឆ្នាំ",
  "Preference": "ចំណូលចិត្ត",
  "Learning and Reviewing": "ការរៀន និងការពិនិត្យឡើងវិញ",
  "Contact": "ទំនាក់ទំនង",
  "CV": "ប្រវត្តិរូបសង្ខេប",
  "Projects": "គម្រោង",
  "Theme": "រចនាប័ទ្ម",
  "Copy Right": "រក្សាសិទ្ធិ © 2024 ផេង សូផល",
  "Work experience": "បទពិសោធន៍ការងារ",
  "Month": "ខែ",
  "Knowledge": "ចំណេះដឹង",
  "Frontend": "ផ្នែកខាងមុខ",
  "Backend": "ផ្នែកខាងក្រោយ",
  "Styling Libraries": "បណ្ណាល័យរចនាបថ",
  "Component UI Libraries": "បណ្ណាល័យ UI រួមផ្សំ",
  "State Management": "ការគ្រប់គ្រងស្ថានភាព",
  "Tools": "ឧបករណ៍",
  "MultiPlatform": "ពហុវេទិកា",
  "Dependency": "ការពឹងផ្អែក",
  "Design": "ការរចនា",
  "Other": "ផ្សេងទៀត",
  "Pheng": "Pheng",
  "Pheng": "Pheng",
  "Pheng": "Pheng"
}
